/*
73. Утверждения типа
Утверждение типа предоставляет доступ к базовому конкретному значению значения интерфейса.

t := i.(T)

Это утверждение проверяет, 
что значение интерфейса i содержит конкретный тип T, 
и присваивает базовое значение T переменной t.

Если i не содержит T, утверждение вызовет панику.

Чтобы проверить, 
содержит ли значение интерфейса определенный тип, 
утверждение типа может возвращать два значения: базовое значение и логическое значение, которое сообщает, 
успешно ли выполнено утверждение.

t, ok := i.(T)

Если i содержит T, то t будет базовым значением, а ok будет true.

Если нет, ok будет false, а t будет нулевым значением типа T, и паники не произойдет.

Обратите внимание на сходство этого синтаксиса с чтением из мапы.
*/

package main

import "fmt"

/*
Задание

Напиши в lesson_73.go функцию describe(i interface{}), которая с помощью только утверждений типа (без %T и без switch) выводит:

- если внутри int: "целое число: X, удвоенное: 2X"
- если внутри string: "строка: X, длина: N"
- если внутри bool: "логическое: X"
- иначе: "неизвестный тип"

Вызови её в main для 42, "Go", true, 3.14 и для nil-интерфейса.
*/

func describe73(i interface{}) {
	if valueInt, ok := i.(int); ok {
		fmt.Println("целое число:", valueInt, ", удвоенное:", 2 * valueInt)
		return
	}
	if valueString, ok := i.(string); ok {
		fmt.Println("строка:", valueString, "длина:", len(valueString))
		return
	}
	if valueBool, ok := i.(bool); ok {
		fmt.Println("логическое:", valueBool)
		return
	}
	if valueFloat, ok := i.(float64); ok {
		fmt.Println("дробное число:", valueFloat)
		return
	}
	fmt.Println("неизвестный тип")
}

func main() {
	// 42, "Go", true, 3.14 и для nil-интерфейса.
	describe73(42)
	describe73("Go")
	describe73(true)
	describe73(3.14)
	var nilInterface interface{}
	describe73(nilInterface)
}
